const quotes = [
    "Η γνώση είναι δύναμη.",
    "Ό,τι κάνεις με πάθος, το κάνεις καλά.",
    "Η αρχή είναι το ήμισυ του παντός.",
    "Η φαντασία είναι πιο σημαντική από τη γνώση. - A. Einstein",
    "Όποιος δεν κάνει λάθη, δεν προσπαθεί αρκετά.",
    "Η ζωή είναι 10% αυτό που σου συμβαίνει και 90% πώς αντιδράς σε αυτό.",
    "Η ζωή είναι σαν ποδήλατο. Για να διατηρήσεις την ισορροπία σου, πρέπει να συνεχίσεις να κινείσαι.",
    "Η μεγαλύτερη δόξα δεν είναι να μην πέφτουμε ποτέ, αλλά να σηκωνόμαστε κάθε φορά που πέφτουμε.",
    "Η ζωή είναι αυτό που συμβαίνει ενώ κάνεις άλλα σχέδια. - J. Lennon",
    "Το μέλλον ανήκει σε αυτούς που πιστεύουν στην ομορφιά των ονείρων τους. - E. Roosevelt",
];

const quoteText = document.getElementById("quote");
const btn = document.getElementById("new-quote");

btn.addEventListener("click", () => {
  const randomIndex = Math.floor(Math.random() * quotes.length);
  quoteText.textContent = quotes[randomIndex]; 
  

});
